updated the code
